Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/administration/security/actions.po
Languages: ru

source: Setting up data actions
ru: Настройка профилей доступа

source: TDG allows you to set permissions for each user role to read and write data that is processed and stored in the system. You can give users data access rights in the web interface by creating an access profile (data action) assigned to any of the user roles.
ru: TDG позволяет управлять правами пользователей на чтение и запись данных, обрабатываемых и хранимых в системе. Чтобы роль пользователя получила права доступа к данным, создайте в веб-интерфейсе профиль доступа (data action) и назначьте этот профиль для нужной роли.

source: Creating a new data action
ru: Создание профиля доступа

source: To set up a new data action:
ru: Чтобы создать новый профиль доступа, выполните следующие шаги:

source: Open the **Settings > Data actions** tab.
ru: Откройте вкладку **Settings > Data actions**.

source: Click **Add data action**.
ru: Нажмите **Add data action**.

source: In the **New data action** dialog, set the data action's ``Name`` and check the ``Read``/ ``Write`` rights for each aggregate:
ru: В диалоговом окне **New data action** задайте имя профиля доступа в поле ``Name`` и выберите права ``Read``/ ``Write`` для каждого агрегата в списке Aggregate:

source: Save the data action by clicking **Save**.
ru: Нажмите **Save**, чтобы сохранить профиль доступа.

source: After creating a data action, you can edit any of its parameters.
ru: Создав профиль доступа, вы можете отредактировать любой его параметр.

source: Assigning data actions to user roles
ru: Привязка профилей доступа к ролям пользователей

source: You can assign data action to any user role created by the administrator. However, assigning data actions to default roles is impossible, as they cannot be edited.
ru: Профиль доступа можно привязать к любой роли пользователя, созданной администратором. Исключения составляют роли по умолчанию, поскольку их нельзя редактировать.

source: To assign a data action to a user role:
ru: Чтобы привязать профиль доступа к роли пользователя, выполните следующие шаги:

source: Switch to the **Settings > Roles** tab.
ru: Откройте вкладку **Settings > Roles**.

source: In the list of roles, choose the role you want to edit and click the pencil edit button.
ru: В списке ролей выберите роль, которую хотите отредактировать, и нажмите на значок карандаша.

source: In the list of all actions, find **Data actions** section and tick the checkbox of the data action you want to assign to the role:
ru: В списке действий найдите раздел **Data actions** и выберите нужный профиль доступа:

source: Click **Apply**.
ru: Нажмите **Apply**.

source: Likewise, you can assign data actions while creating a new role.
ru: Вы также можете привязывать профили доступа, когда создаете новую роль.
