Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/administration/security/role-access.po
Languages: ru

source: Role-based access control
ru: Контроль доступа на основе ролей

source: Tarantool Data Grid has a role-based model of access to system functions and data stored in the system. The administrator sets data access permissions via UI or external tools (LDAP). Each role has a set of permissions that determine what users or external applications with that role can access and change.
ru: В Tarantool Data Grid используется основанная на ролях модель доступа к системным функциям и данным, хранящимся в системе. Администратор настраивает права доступа к данным, используя UI или такие внешние инструменты, как LDAP. Каждая роль имеет набор разрешений, которые определяют, что пользователи или внешние приложения могут просматривать или изменять.

source: You can find the list of roles on the **Settings > Roles** tab:
ru: Список ролей можно найти на вкладке **Settings > Roles**:

source: Default roles
ru: Роли по умолчанию

source: There are three default roles that you can assign to users and external applications for authorized access and actions in the system:
ru: Пользователям и внешним приложениям можно назначать роли. Эти роли позволяют получать авторизованный доступ к определенным данным и выполнять в системе те или иные действия. Существует три роли по умолчанию:

source: The default roles have a predefined set of permissions, and they cannot be edited or deleted.
ru: Эти роли имеют предопределенный набор прав. Кроме того, такие роли нельзя редактировать или удалять.

source: Role
ru: Роль

source: Authority
ru: Доступ к функциям

source: Data access
ru: Доступ к данным

source: Full access to TDG functions
ru: Полный доступ ко всем функциям TDG

source: Read and write access for all aggregates
ru: Доступ для чтения и записи для всех агрегатов

source: Full read-only access to TDG functions
ru: Полный доступ в режиме "только для чтения"

source: Read access for all aggregates
ru: Доступ для чтения для всех агрегатов

source: user
ru: user (пользователь)

source: Default access: has access to the Test tab to send test objects, the Repair Queues tab, the Tasks tab, and the GraphQL tab.
ru: По умолчанию: доступ к вкладке Test для отправки объектов тестирования, а также ко вкладкам Repair Queues, Tasks и GraphQL

source: Adding new user roles via UI
ru: Создание новых ролей пользователей с помощью UI

source: You can create new user roles based on the default roles or the roles you've already created.
ru: Новую роль можно создать на основе роли по умолчанию или же ранее созданной роли.

source: To create a new user role:
ru: Чтобы создать новую роль пользователя, выполните следующие шаги:

source: Switch to the **Settings > Roles** tab and click **Add new role**.
ru: Откройте вкладку **Settings > Roles** и нажмите **Add new role**.

source: In the **New role** dialog, set the following parameters:
ru: В диалоговом окне **New role** укажите следующие параметры:

source: ``Name``: the name of the new role.
ru: ``Name``: название новой роли.

source: ``Description``: an optional description of the new role.
ru: ``Description``: описание роли (опционально).

source: ``Roles``: an optional selection of the existing role on the basis of which the new role will be created.
ru: ``Roles``: существующая роль, на основе которой будет создаваться новая (опционально).

source: In the list of actions, select the actions that will be available to the new user role. Don't forget to check whether the role allows access to the interface page. For example, if you allow the new role to make GraphQL queries, make sure to check the box **Pages Access > Show GraphQL page** in the list of actions.
ru: В списке выберите действия, которые будут доступны для роли пользователя. Не забудьте проверить, есть ли у роли доступ к интерфейсу. Например, если вы собираетесь дать роли права на выполнение запросов GraphQL, отметьте **Pages Access > Show GraphQL page**.

source: Click **Add new role**.
ru: Нажмите **Add new role**.

source: After you've created a new user role, you can edit or delete it any time.
ru: Создав роль пользователя, вы можете в любое время отредактировать ее или удалить.
