Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/administration/security/tokens.po
Languages: ru

source: Adding tokens
ru: Добавление токенов

source: Tokens help external system applications to get authorized access to TDG data and functions. In the web interface, the administrator generates a token, assigns it access rights to TDG objects, and passes the token to the developers of the external system.
ru: С помощью токенов внешние системные приложения получают авторизованный доступ к данным и функциям TDG. Администратор через веб-интерфейс генерирует токен, назначает для него нужные права доступа к объектам TDG и передает его разработчикам внешней системы.

source: You can generate a token in the **Settings > Tokens** tab:
ru: Сгенерировать токен можно на вкладке **Settings > Tokens**:

source: Click **Add token**:
ru: Нажмите **Add token**:

source: In the **Create token** dialog, submit the following parameters:
ru: В диалоговом окне **Create token** укажите следующие параметры:

source: ``Name``: the name (key) of the token, which will further identify it in the system.
ru: ``Name``: имя (ключ) токена, по которому он будет идентифицироваться в системе.

source: ``Expires in``: token expiration date. This parameter is optional.
ru: ``Expires in``: срок действия токена (опционально).

source: ``Role``: token role. Similar to the user's role according to the :doc:`role model of access <role-access>`.
ru: ``Role``: роль токена. Аналогична роли пользователя в :doc:`ролевой модели доступа <role-access>`.

source: ``Tenant``: leave the **Default** parameter unless you have several tenants. In that case, choose the name of the tenant.
ru: ``Tenant``: оставьте значение по умолчанию **Default**, если у вас только один тенант. Если их несколько, выберите тенант, для которого создается пользователь.

source: Click **Submit** to generate a token.
ru: Нажмите **Submit**, чтобы сгенерировать токен.

source: The token will be explicitly available only in the message in the web interface:
ru: В веб-интерфейсе появится сообщение, где токен будет представлен в явном виде:

source: For security reasons, the token is only shown explicitly once when it is generated. The token message will disappear as soon as you leave this page or generate a new token.
ru: В целях безопасности токен в явном виде показывается только один раз, при генерации. Сообщение с токеном исчезнет, как только вы покинете страницу или сгенерируете новый токен.

source: After you've created a token, you cannot edit its name and tenant, only its role and the validity period.
ru: Ни имя созданного токена, ни тенант, для которого он сгенерирован, редактировать невозможно. Однако вы можете изменять роль токена и его срок действия.

source: You can block, delete, export, and import tokens similarly to :doc:`user profiles <users>`.
ru: Как и :doc:`профили пользователей <users>`, токены можно блокировать, удалять, экспортировать и импортировать.
