Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/administration/security/users.po
Languages: ru

source: Managing users
ru: Управление пользователями

source: This chapter describes the TDG user management operations:
ru: В этой главе рассматриваются операции управления пользователями TDG:

source: The list of users is in the **Settings > Users** tab:
ru: Список пользователей находится на вкладке **Settings > Users**:

source: Creating and editing user profiles
ru: Создание и редактирование профилей пользователей

source: Creating a new user
ru: Создание профиля пользователя

source: To create a new TDG user:
ru: Чтобы создать профиль пользователя TDG, выполните следующие шаги:

source: Switch to the **Settings > Users** tab. Click **Add new user**. You will get the **New user** dialog:
ru: Откройте вкладку **Settings > Users**. Нажмите **Add new user**. Откроется диалоговое окно создания пользователя **New user**:

source: In the **New user** dialog, set the following parameters:
ru: В окне **New user** укажите следующие параметры:

source: ``Name``: user name.
ru: ``Name``: имя пользователя.

source: ``Email``: user email.
ru: ``Email``: электронная почта пользователя.

source: ``Password``: a password to log into the system. There are several options here: you can generate a password by clicking **Generate** or leave an empty field. In the second case, the system will automatically generate and send a password to the user's ``Email``, but it requires :ref:`a configured SMTP server <smtp-server>`.
ru: ``Password``: пароль для авторизации в системе. Сгенерируйте пароль сразу, нажав кнопку **Generate**, или оставьте поле пустым, чтобы система отправила автоматически сгенерированный пароль на адрес электронной почты, указанный в поле ``Email``. В последнем случае необходим :ref:`настроенный SMTP-сервер <smtp-server>`.

source: ``Expires in``: password expiration date. This field is optional. Passwords are checked for expiration approximately every 30 minutes. Accounts with expired passwords are blocked.
ru: ``Expires in``: срок действия пароля (опционально). Система проверяет, не истек ли срок действия паролей, примерно раз в 30 минут. Учетные записи, у которых истек срок действия пароля, блокируются.

source: ``Role``: user role according to the role-based model of access.
ru: ``Role``: роль пользователя согласно ролевой модели доступа.

source: ``Tenant``: leave the **Default** parameter unless you have several tenants. In that case, choose the name of the tenant to add the user to.
ru: ``Tenant``: оставьте значение по умолчанию **Default**, если у вас только один тенант. Если их несколько, выберите тенант, для которого создается пользователь.

source: Click **Submit**.
ru: Нажмите **Submit**.

source: You will now see the new user in the list of users. After you've created a user, you can edit the user's profile: change profile settings, reset password, block or delete the user.
ru: Созданного пользователя вы увидите в общем списке. Теперь можно отредактировать его профиль: изменить настройки, сбросить пароль, а также заблокировать или удалить профиль.

source: Editing a user profile
ru: Редактирование профиля пользователя

source: To edit a user profile, open the **Settings > Users** tab and click the pencil edit button:
ru: Чтобы отредактировать профиль пользователя, откройте вкладку **Settings > Users** и нажмите на значок карандаша:

source: Change profile settings and click **Submit**.
ru: Измените настройки профиля и нажмите **Submit**.

source: Deleting a user
ru: Удаление профиля пользователя

source: The administrator can delete any user from the user list:
ru: Администратор может удалить из списка любой профиль пользователя:

source: In the **Actions** column, choose the user profile you want to delete, click the ``...`` button, and select **Delete user**.
ru: В колонке **Actions** найдите профиль нужного пользователя. В меню действий ``...`` выберите **Delete user**.

source: In the dialog tab, confirm the deletion of the user by clicking OK.
ru: В диалоговом окне подтвердите удаление пользователя, нажав OK.

source: The deleted user will be automatically removed from the list of users.
ru: Пользователь будет удален из общего списка автоматически.

source: Changing user status
ru: Изменение статуса пользователя

source: After you've created a user's profile, it is automatically activated in the system. You'll see the "ACTIVE" status in the **Status** column in the list of users. As an administrator, you can change this status and block the user:
ru: Созданный профиль будет сразу активирован в системе. В списке пользователей напротив этого профиля в колонке **Status** появится статус "ACTIVE". Администратор может изменить этот статус и заблокировать пользователя:

source: In the **Actions** column, click the ``...`` button and select **Block**:
ru: В колонке **Actions** в меню действий ``...`` выберите **Block**:

source: In the dialog tab, write the reason why you are blocking this user and click **Block**:
ru: В диалоговом окне опишите причину блокировки пользователя и нажмите **Block**:

source: After that, the user's status will change to "BLOCKED". To unblock the user, click the ``...`` button and select **Unblock**.
ru: После этого статус пользователя изменится на "BLOCKED". Чтобы разблокировать пользователя, в меню действий ``...`` выберите **Unblock**.

source: Resetting a password
ru: Сброс пароля

source: The administrator can reset the password of any user:
ru: Администратор может сбросить пароль любого из пользователей:

source: In the **Actions** column, choose the user profile you want to update, click the ``...`` button, and select **Reset password**.
ru: В колонке **Actions** найдите профиль пользователя, который вы хотите отредактировать, и в меню действий ``...`` выберите **Reset password**.

source: In the dialog tab, confirm the resetting of the password by clicking OK.
ru: В диалоговом окне подтвердите сброс пароля, нажав OK.

source: The user will get a temporary password via email that is set in the user's profile.
ru: После этого пользователю придет временный пароль на электронную почту, указанную в его профиле.

source: **Note:** to send a temporary password, you need a configured SMTP server.
ru: **Примечание:** чтобы отправлять временные пароли, настройте SMTP-сервер.

source: To set the workflow for sending temporary passwords:
ru: Чтобы организовать отправку временных паролей, выполните следующие шаги:

source: Install and start the SMTP server.
ru: Разверните и запустите SMTP-сервер.

source: In the ``config.yml`` file with TDG configuration, write the following settings:
ru: В файле конфигурации TDG ``config.yml`` пропишите следующие настройки:

source: connector: output: - name: to_smtp type: smtp url: <URL of SMTP server> from: <sender's address> timeout: <timeout value, seconds> account_manager: only_one_time_passwords: true output: name: to_smtp
ru: connector: output: - name: to_smtp type: smtp url: <URL SMTP-сервера> from: <адрес отправителя> timeout: <время ожидания в секундах> account_manager: only_one_time_passwords: true output: name: to_smtp

source: For example:
ru: Пример:

source: Upload the changed configuration to the system.
ru: Загрузите измененную конфигурацию в систему.

source: Exporting and importing users
ru: Экспорт и импорт профилей пользователей

source: You can export and import user profiles in JSON format:
ru: Профили пользователей можно экспортировать из системы и импортировать в нее в формате JSON:

source: Exporting users
ru: Экспорт профилей пользователей

source: In the **Settings > Users** tab, click **Export**. The system will generate and export a JSON file. This file will contain an array with profiles of all current users.
ru: На вкладке **Settings > Users** нажмите **Export**. Система сформирует и экспортирует файл JSON, содержащий массив с профилями всех текущих пользователей.

source: Here is a user profile example:
ru: Пример профиля пользователя:

source: Importing users
ru: Импорт профилей пользователей

source: To import users, you need a JSON file with an array of user profiles. You can make this file manually or generate it as described in the previous topic about the export. The JSON file must include the fields listed above in the user profile example, except for the fields called ``state_reason``, ``last_login``, ``last_password_update_time``, ``password``.
ru: Для импорта необходим файл в формате JSON с профилями пользователей. Этот файл можно подготовить вручную или же сформировать его и экспортировать, как описано выше. В файле JSON нужно задать все поля, указанные выше в примере профиля пользователя, за исключением ``state_reason``, ``last_login``, ``last_password_update_time`` и ``password``.

source: As for the password, there are several ways to set it:
ru: Пароль можно задать несколькими способами:

source: Manually: In the JSON file, set a ``password`` for every user. Make sure the passwords meet the :ref:`password policy <password-policy>` requirements. In the **Import users from JSON file** dialog, do not check any boxes. The passwords will be uploaded from the JSON file as-is.
ru: Вручную. В файле JSON укажите для каждого пользователя пароль в поле ``password``. Пароль должен соответствовать требованиям :ref:`политики в отношении паролей <password-policy>`. В диалоговом окне импорта профилей пользователей не отмечайте никакие параметры. Пароли будут загружены из файла JSON как есть.

source: **Generate passwords**: Set ``null`` in the ``password`` field or don't include this field in the JSON file at all. In the **Import users from JSON file** dialog, check the box **Generate passwords**. The password will be automatically generated according to the current password policy.
ru: Сгенерировать автоматически. Задайте ``null`` в поле ``password`` или вообще не указывайте это поле в файле JSON. В диалоговом окне импорта профилей пользователей выберите **Generate passwords**. Пароль будет создан автоматически в соответствии с требованиями текущей политики в отношении паролей.

source: **Send password via users email**: You need a :ref:`configured SMTP server <smtp-server>` for this. In the **Import users from JSON file** dialog, check the **Send password via users email** box.
ru: Отправить на адрес электронной почты. Для этого необходим :ref:`SMTP-сервер <smtp-server>`. В диалоговом окне **Import users from JSON file** выберите **Send password via users email**.

source: You need to choose only one of the listed options for all imported users.
ru: Нужно выбрать единственный вариант создания паролей для всех импортируемых профилей пользователей.

source: Here is how to import users:
ru: Чтобы импортировать профили пользователей, выполните следующие шаги:

source: In the **Settings > Users** tab, click **Import**.
ru: На вкладке **Settings > Users** нажмите **Import**.

source: In the **Import users from JSON file** dialog, check one of the boxes or leave the boxes empty. It depends on the option you chose to set the users' passwords.
ru: Если необходимо, в диалоговом окне импорта профилей пользователей отметьте способ создания паролей, который вы выбрали.

source: Upload the JSON file with user profiles and click **Apply**.
ru: Загрузите файл JSON с профилями пользователей и нажмите **Apply**.

source: The new user profiles will now be added to the **Users** list table. The profile data will be shown in the web interface in the message containing the results of the import operation.
ru: Новые профили пользователей будут добавлены в таблицу **Users**. В веб-интерфейсе вы увидите сообщение о результатах импорта, где будут указаны данные профилей.

source: You can save the imported data, including the generated passwords, by clicking **Download**. The data will be saved as a ``.csv`` file.
ru: Вы можете сохранить импортированные данные, в том числе сгенерированные пароли, нажав кнопку **Download**. Данные будут сохранены в файле ``.csv``.

source: Managing password policy
ru: Управление политикой в отношении паролей

source: TDG has a password policy for users to sign into the system. This policy applies to the passwords that users set manually as well as to automatically generated passwords. The administrator can control the password policy in the **Settings > Password Policy** tab:
ru: Авторизацию пользователей в системе регулирует политика TDG в отношении паролей. Она применима в равной степени как к паролям, которые пользователи задают вручную, так и к автоматически сгенерированным паролям. Управлять политикой в отношении паролей можно на вкладке **Settings > Password Policy**:

source: Default password settings include lowercase and uppercase characters and digits from 0 to 9, inclusive. The default password length is 8 characters. You can change the default settings and click **Save**.
ru: Согласно настройкам по умолчанию пароль должен содержать буквы в нижнем и верхнем регистре, а также цифры от 0 до 9. Вы можете изменить настройки по умолчанию и сохранить их, нажав **Save**.
