Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/intro.po
Languages: ru

source: Introduction to Tarantool Data Grid 2.0
ru: Введение в Tarantool Data Grid 2.0

source: Tarantool Data Grid (TDG) is a product that makes it easier to create and maintain business solutions on the Tarantool platform. It is a separate product that complements Tarantool Enterprise. TDG allows you to launch solutions quickly and with minimal developer involvement.
ru: Tarantool Data Grid (TDG) облегчает создание и поддержку бизнес-решений на платформе Tarantool. Это отдельный продукт, который дополняет Tarantool Enterprise. TDG позволяет запускать решения быстро и с минимальным участием разработчиков.

source: Here's an example of a solution: a data mart that integrates data on customer accounts and credits and displays it in mobile and web application.
ru: Вот пример решения: витрина для интеграции данных по счетам и кредитам клиента, чтобы отображать их в мобильном и веб-приложении.

source: There are only three steps to create a business solution using Tarantool Data Grid:
ru: Чтобы создать бизнес-решение на Tarantool Data Grid, нужно выполнить всего 3 шага:

source: **Step 1:** Describe the data object model.
ru: **Шаг 1:** Описать модель объекта данных.

source: **Step 2:** Set the data combination logic.
ru: **Шаг 2:** Задать логику объединения данных.

source: **Step 3:** Run the solution on a single server.
ru: **Шаг 3:** Запустить решение на одном сервере.

source: Once you've integrated TDG, a non-programmer, such as an analyst or an architect, can maintain and develop the solution. It is possible, because you get the maximum functionality out of the box to implement typical scenarios, such as data integrity checks or error handling, and needs that arise while creating solutions.
ru: С помощью TDG поддерживать и развивать решение сможет и не-программист: аналитик или архитектор. Уже «из коробки» вы получаете максимум готовой функциональности для реализации типовых сценариев, вроде проверки целостности данных или обработки ошибок, и потребностей, которые возникают при создании решений.

source: Here are the guides that explain how to work with the Tarantool Data Grid system:
ru: Руководства по работе с системой Tarantool Data Grid:

source: :doc:`For administrators </administration>`
ru: :doc:`Для администраторов </administration>`

source: :doc:`For developers </development>`
ru: :doc:`Для разработчиков </development>`
