Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/release/whats-new.po
Languages: ru

source: What's new in Tarantool Data Grid 2.0
ru: Новые возможности Tarantool Data Grid 2.0

source: Tarantool Data Grid (TDG) version 2.0 brings a lot of new features. This document tells about all major changes and new capabilities in version 2.0:
ru: В версии 2.0 Tarantool Data Grid (TDG) появилось много новых функциональных возможностей. В этом документе описываются все основные изменения и новые технические возможности версии 2.0:

source: Simplified architecture
ru: Упрощенная архитектура

source: Tarantool Data Grid 2.0 has four easily scalable components:
ru: Tarantool Data Grid 2.0 включает в себя четыре легко масштабируемых компонента:

source: ``Core``: configuration and administration
ru: ``Core``: настройка и администрирование

source: ``Storage``: data validation and storage
ru: ``Storage``: проверка и хранение данных

source: ``Runner``: running the business logic using Lua code
ru: ``Runner``: запуск бизнес-логики с помощью кода на Lua

source: ``Connector``: data exchange with external systems
ru: ``Connector``: обмен данными с внешними системами

source: You can add nodes instantly, with automatic data redistribution. One TDG cluster consists of several replica sets. In case one of the servers is down, the replica set keeps running without losing any data.
ru: Узлы можно добавлять в кластер мгновенно, при этом данные перераспределяются автоматически. Один кластер TDG состоит из нескольких наборов реплик. Если один из серверов остановится, набор реплик продолжит работать, не теряя при этом никаких данных.

source: You can create as many replica sets with ``storage``, ``runner``, and ``connector`` components as you like. The only exception is the ``core``. There can be only one replica set that contains the ``core`` component.
ru: Можно создавать сколько угодно наборов реплик с компонентами ``storage``, ``runner`` и ``connector``. Единственное исключение — ``core``. Только один набор реплик может содержать компонент ``core``.

source: Handlers instead of data pipelines
ru: Обработчики вместо конвейеров обработки данных

source: When Tarantool Data Grid receives a data package from an external system, it needs to process the data before putting it into a storage.
ru: Когда Tarantool Data Grid получает пакет данных из внешней системы, ему нужно обработать данные, прежде чем поместить их в хранилище.

source: **In version 1.6**, data pipelines processed the incoming data by consecutively calling multiple functions. However, writing code to build these pipelines was a bit of a challenge.
ru: **В версии 1.6** конвейеры (пайплайны, pipelines) обрабатывали входящие данные, последовательно вызывая несколько функций. Но написание кода этих конвейеров было непростой задачей.

source: **In version 2.0**, there are handlers instead of pipelines. Handlers are functions that process the incoming and outcoming data. You can write a handler function using Lua and then bind it to any connector.
ru: **В версии 2.0** вместо конвейеров появились обработчики. Обработчики — это функции, которые обрабатывают входящие и исходящие данные. Можно написать функцию-обработчик на Lua, а затем привязать ее к любому коннектору.

source: An input handler processes all incoming data. After that, data objects are validated and put in a storage. In case the validation process finishes with an error, objects are put in a repair queue.
ru: Обработчик ввода обрабатывает все входящие данные. После этого объекты данных проверяются и помещаются в хранилище. Если процесс проверки завершается с ошибкой, объекты попадают в ремонтную очередь.

source: Visual data model constructor
ru: Визуальный конструктор модели данных

source: Data model explicitly determines the structure of data. All incoming data is verified, validated, and stored by the provided data model.
ru: Модель данных в явном виде определяет структуру данных. Все входящие данные проверяются, подтверждаются и хранятся в соответствии с предоставленной моделью данных.

source: Tarantool Data Grid uses `Avro Schema <https://avro.apache.org/>`_ to describe data model. **In version 2.0**, there is no need to write code to describe data structure. Everything is done via an interface that is called a model editor. Model editor has multiple options like adding a field, naming it, setting its type and value, as well as leaving comments.
ru: Для описания модели данных Tarantool Data Grid использует формат `Apache Avro <https://avro.apache.org/>`_. **В версии 2.0** нет необходимости писать код, чтобы описать структуру данных. Все действия выполняются через интерфейс, который называется редактором модели. В редакторе модели доступно множество операций, таких как добавление поля, присвоение ему имени, установка его типа и значения, а также есть возможность оставить комментарий.

source: Optional data versioning
ru: Опциональное версионирование данных

source: Data versioning allows one to trace what changes have been made to a data package and when. Data package is a collection of data.
ru: Версионирование данных позволяет отследить, какие изменения были внесены в пакет данных и когда. Пакет данных — это набор данных.

source: In Tarantool Data Grid, when you put a data package in a storage, it is identified by the primary index. If an incoming package has the same primary index yet different data fields, TDG will not delete the already stored data. It will store the new data as a new version.
ru: Когда пакет данных попадает в хранилище Tarantool Data Grid, он идентифицируется по первичному индексу. Если первичный индекс у входящего пакета совпадает с уже имеющимся пакетом, TDG не будет удалять хранящиеся данные. Он сохранит новые данные как новую версию этого пакета.

source: Version history often comes in handy, but it has one side effect. The bigger version history is, the more it influences the performance of the storage.
ru: История версий полезна, но у нее есть один побочный эффект. Чем длиннее история версий, тем больше она влияет на производительность хранилища.

source: **In TDG 2.0**, versioning is off by default. It means that data packages with the same primary index will rewrite each other. This increases performance and reduces the amount of space taken up by the database. But if you need to keep version history, you can always switch this option on.
ru: **В Data Grid 2.0** версионирование выключено по умолчанию. Это значит, что пакеты данных с одинаковым первичным индексом перезаписывают друг друга. Благодаря этому повышается производительность и сокращается объем занимаемого базой данных места. Но если вам нужно хранить историю версий, версионирование всегда можно включить.

source: Multitenancy
ru: Мультитенантность

source: Tenant is a single team's workspace. Due to multitenancy, several teams can use a single TDG instance and work on it independently. Tarantool Data Grid helps isolate the code and data through a system of roles and permissions. Each tenant has its own users. Teams work separately, have no access to each other's data, and do not interfere with each other's processes.
ru: Тенант — это рабочее пространство отдельной команды. Благодаря мультитенантности несколько команд могут использовать один экземпляр TDG и работать в нем независимо друг от друга. Tarantool Data Grid помогает изолировать код и данные с помощью системы ролей и разрешений. У каждого тенанта — свои пользователи. Команды работают отдельно, не имеют доступа к данным друг друга и не вмешиваются в процессы друг друга.

source: **Perks:** you make the most of your hardware. Also, TDG interface helps administer such a system by creating teams, roles and giving different rights to users.
ru: **Преимущества:** вы максимально эффективно используете свое оборудование. Кроме того, интерфейс TDG помогает администрировать такую систему: создавать команды, роли и выдавать различные права пользователям.
