Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/development/hello-world-lua.po
Languages: ru

source: Hello world with Lua
ru: Hello world на Lua

source: This guide explains how to set up a data model, run data queries, and write a couple of stored procedures in Lua.
ru: Из этого руководства вы узнаете, как настраивать модель данных, выполнять запросы и создавать хранимые процедуры на языке Lua.

source: First, you will need a running TDG instance. You can :doc:`run TDG as a Docker container </administration/deployment/run-in-docker>`, or deploy it on your machine :doc:`manually </administration/deployment/manual-deployment>` or with :doc:`Ansible </administration/deployment/ansible-deployment>`.
ru: Для начала вам понадобится запущенный экземпляр TDG. Можно :doc:`запустить TDG в Docker-контейнере </administration/deployment/run-in-docker>` или же развернуть его на локальной машине :doc:`вручную </administration/deployment/manual-deployment>` или с помощью :doc:`Ansible </administration/deployment/ansible-deployment>`.

source: Then you will learn how to:
ru: Затем вы сможете:

source: :ref:`Set up the data model <set-up-data-model>`.
ru: :ref:`настроить модель данных <set-up-data-model>`;

source: :ref:`Run data queries <run-data-queries>`.
ru: :ref:`выполнить запрос данных <run-data-queries>`;

source: :ref:`Write stored procedures <write-stored-procedures>`.
ru: :ref:`написать хранимые процедуры <write-stored-procedures>`.

source: Setting up the data model
ru: Настройка модели данных

source: This guide uses a data model that contains two types of objects: music bands and artists. Each music band has a name, a genre, and a year it was formed. Artists have a name, a country, and the instruments they play.
ru: В этом руководстве используется модель данных, содержащая два типа объектов: музыкальные группы и исполнители. У каждой музыкальной группы есть название, жанр и год ее создания. Для исполнителей указываются имена, страны происхождения и инструменты, на которых они играют.

source: Here is an example of such a model:
ru: Вот пример такой модели:

source: In the menu on the left, there is a tab called **Model**. Switch to this tab and paste the model to the **Request** field. Click **Submit**:
ru: В меню слева есть вкладка **Model**. Откройте ее и вставьте модель в поле **Request**. Нажмите **Submit**:

source: You have set up the data model. Now you can upload, select, and delete data.
ru: Вы настроили модель данных. Теперь можно выполнять загрузку, выборку и удаление данных.

source: Uploading data to TDG
ru: Загрузка данных в TDG

source: In the menu on the left, there is a tab called **GraphQL**. Switch to this tab, select **default** as the desired scheme, and clear the request field:
ru: В меню слева есть вкладка под названием **GraphQL**. Откройте эту вкладку, выберите необходимую схему **default** и удалите всё из поля запроса:

source: Paste the following data to the request field:
ru: В поле запроса вставьте такие данные:

source: Execute query by clicking the play button:
ru: Нажмите кнопку воспроизведения, чтобы выполнить запрос:

source: The data is now uploaded.
ru: Данные загружены.

source: Running data queries
ru: Выполнение запросов данных

source: Reading data
ru: Чтение данных

source: You can read data in the **Graphql** tab. Make sure the **default** scheme is switched on, clear the field on the left, and write a request that selects every music band:
ru: Читать данные можно на вкладке **Graphql**. Убедитесь, что выбрана схема **default**, удалите всё из поля слева и напишите запрос на выборку всех музыкальных групп:

source: Click the play button. In the right field, you'll get the result:
ru: Нажмите кнопку воспроизведения. В поле справа вы увидите результат:

source: Select data by the primary key:
ru: Выполните выборку данных по первичному ключу:

source: After clicking the play button, you will get all stored information about the Black Sabbath music band:
ru: Нажав на кнопку воспроизведения, вы получите всю сохраненную информацию о группе Black Sabbath:

source: Changing data
ru: Изменение данных

source: Add one more music genre to one of the music bands. In the **GraphQL** tab, insert the data about the band with two genres instead of one:
ru: Добавьте еще один музыкальный жанр для одной из групп. Для этого на вкладке **GraphQL** внесите информацию о двух жанрах для группы:

source: Click the play button. The information about the Deep Purple music band is now updated.
ru: Нажмите кнопку воспроизведения. Информация о группе Deep Purple обновилась.

source: Deleting data
ru: Удаление данных

source: In the **GraphQL** tab, write the query to delete all data about one of the music bands:
ru: На вкладке **GraphQL** напишите запрос на удаление всех данных об одной из музыкальных групп:

source: Click the play button. You've deleted the data about the Linkin Park music band.
ru: Нажмите кнопку воспроизведения. Все данные о музыкальной группе Linkin Park удалены.

source: Writing stored procedures
ru: Написание хранимых процедур

source: In the menu on the left, there is a tab called **Code**. Switch to the tab and create the ``src`` directory. In the ``src`` directory, create the ``hello.lua`` file, which is a Lua module that exports the functions:
ru: В меню слева есть вкладка **Code**. Откройте эту вкладку и создайте директорию ``src``. В директории ``src`` создайте файл ``hello.lua``, представляющий собой Lua-модуль для экспорта функций:

source: Click **Apply**:
ru: Нажмите **Apply**:

source: This Lua module requires a GraphQL interface. In the **Code** tab, create a file called ``services.yml`` and specify the signature of the GraphQL call:
ru: Для этого Lua-модуля необходим GraphQL-интерфейс. На вкладке **Code** создайте файл под названием ``services.yml`` и задайте сигнатуру GraphQL-вызова:

source: The code is validated and uploaded to the cluster. If there is an error, a notification at the bottom right corner will give you the details about it.
ru: Код проверяется и загружается в кластер. Если произойдет ошибка, в правом нижнем углу вы увидите уведомление с ее описанием.

source: Now switch to the **Graphql** tab, select **default** the desired scheme, and call the stored procedure:
ru: Откройте вкладку **Graphql**, выберите необходимую схему **default** и вызовите хранимую процедуру:

source: In the right field, you'll get the result:
ru: В поле справа вы получите результат:

source: Randomized playlist
ru: Плейлист со случайным порядком воспроизведения

source: In the dataset, there are various music bands. Make a stored procedure to give you a randomized playlist.
ru: В наборе данных есть разные музыкальные группы. Создайте хранимую процедуру для создания плейлиста, который будет воспроизводить песни в случайном порядке.

source: In the **Code** tab, open the ``src`` directory and create a file called ``playlist.lua``. This file defines the logic to generate a randomized playlist:
ru: На вкладке **Code** откройте директорию ``src`` и создайте файл под названием ``playlist.lua``. В этом файле задайте логику для создания плейлиста со случайным порядком воспроизведения:

source: In the ``services.yml``, specify the signature of the GraphQL call:
ru: В файле ``services.yml`` задайте сигнатуру GraphQL-вызова:

source: Switch to the **GraphQL** tab and run this command:
ru: Перейдите на вкладку **GraphQL** и выполните такую команду:

source: Click the play button. As a result, you'll get a randomized playlist:
ru: Нажмите кнопку воспроизведения. В результате вы получите плейлист, в котором группы представлены в случайном порядке:

source: Each time you click the play button, you'll get a different playlist.
ru: Выполняя это команду, вы каждый раз будете получать новый плейлист.
