Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/development/requests.po
Languages: ru

source: Data access requests
ru: Запросы данных

source: In this chapter, you will go through a number of use cases to understand the logic and syntax of data access requests in TDG.
ru: Глава посвящена запросам данных в TDG. В ней описаны логика и синтаксис запросов, а также представлено несколько сценариев использования.

source: You will use the already :doc:`deployed TDG cluster </administration/deployment/ansible-deployment>` as the environment to run requests.
ru: В качестве среды для выполнения запросов вы будете использовать уже :doc:`развернутый TDG-кластер </administration/deployment/ansible-deployment>`.

source: Preparing a data model
ru: Подготовка модели данных

source: To upload data in TDG and then access the data via GraphQL requests, you need to define a data model first. You will use a simple model that has two object types—``Country`` and ``City``—with the following fields, indexes, and relations:
ru: Чтобы загрузить данные в TDG, а затем получать к ним доступ через запросы GraphQL, вам нужно сначала определить модель данных. В нашем примере приводится простая модель с двумя типами объектов: ``Country`` (страна) и ``City`` (город). В модели представлены следующие поля, индексы и отношения:

source: To upload the data model to TDG, you need to present it in the *Avro Schema* notation:
ru: Чтобы загрузить модель данных в TDG, ее надо представить в виде *схемы данных Avro*:

source: Uploading the data model
ru: Загрузка модели данных

source: Next, you need to upload the :ref:`data model <graphql_model_avro>` to TDG. You can do so in the web interface.
ru: Теперь необходимо загрузить :ref:`модель данных <graphql_model_avro>` в TDG. Это можно сделать через веб-интерфейс.

source: In a web browser, open the TDG web interface on an instance in a replica set with the "runner" cluster role. You can use the already :doc:`deployed TDG cluster </administration/deployment/ansible-deployment>`. In this case, the instance's URL will be `http://172.19.0.2:8082 <http://172.19.0.2:8082>`_.
ru: Откройте в браузере веб-интерфейс TDG на экземпляре, входящем в набор реплик с кластерной ролью "runner". Если вы используете уже :doc:`развернутый TDG-кластер </administration/deployment/ansible-deployment>`, URL экземпляра будет следующий: `http://172.19.0.2:8082 <http://172.19.0.2:8082>`_.

source: On the left menu, click the **Model** tab.
ru: В меню слева выберите вкладку **Model** (Модель).

source: Paste the :ref:`data model <graphql_model_avro>` into the **Request** field.
ru: Вставьте :ref:`модель данных <graphql_model_avro>` в поле **Request** (Запрос).

source: Click **Submit**.
ru: Нажмите **Submit**.

source: The data model has been uploaded. Now you can insert (upload), select, and delete data.
ru: Модель данных загружена. Теперь можно добавлять (загружать), выбирать и удалять данные.

source: Uploading data
ru: Загрузка данных

source: You can upload data in TDG by means of a GraphQL mutation:
ru: Загрузить данные в TDG можно с помощью мутации GraphQL:

source: On the left menu, click the **GraphQL** tab.
ru: В меню слева выберите вкладку **GraphQL**.

source: Select **default** for the desired scheme and clear the request field.
ru: Выберите **default** в качестве нужной схемы и очистите поле запроса.

source: Paste the following request into the left field:
ru: В поле слева вставьте следующий запрос:

source: Execute the mutation by clicking the **Execute Query** button:
ru: Выполните мутацию, нажав кнопку **Execute Query** (Выполнить запрос):

source: The data has been uploaded, as you can see by the system response in the right field.
ru: Данные загружены, как видно по ответу системы в поле справа.

source: Here are the common use cases for data access requests:
ru: Вот типичные сценарии использования, связанные с запросами данных:

source: :ref:`General object type query <graphql_queries_gen>`
ru: :ref:`Общий запрос объектов по типу <graphql_queries_gen>`

source: :ref:`Requests by primary index <graphql_queries_prim>`
ru: :ref:`Запросы по первичному индексу <graphql_queries_prim>`

source: :ref:`Requests by secondary index <graphql_queries_second>`
ru: :ref:`Запросы по вторичному индексу <graphql_queries_second>`

source: :ref:`Requests by compound index <graphql_queries_compound>`
ru: :ref:`Запросы по составному индексу <graphql_queries_compound>`

source: :ref:`Comparison operators <graphql_queries_compar>`
ru: :ref:`Операторы сравнения <graphql_queries_compar>`

source: :ref:`Multiple conditions <graphql_queries_multiple>`
ru: :ref:`Множественные условия <graphql_queries_multiple>`

source: :ref:`Requests by relations <graphql_queries_relations>`
ru: :ref:`Запросы по отношениям <graphql_queries_relations>`

source: :ref:`Pagination <graphql_queries_pagination>`
ru: :ref:`Разбиение на страницы <graphql_queries_pagination>`

source: :ref:`Requests by version <graphql_queries_version>`
ru: :ref:`Запросы по версии <graphql_queries_version>`

source: The easiest way to run GraphQL request examples is to use the embedded GraphiQL client in the TDG web interface. For data access requests, use the **default** scheme:
ru: Примеры запросов GraphQL, приведенные ниже, проще всего запустить через встроенный клиент GraphiQL в веб-интерфейсе TDG. Отправляя запросы на доступ к данным, используйте схему по умолчанию (**default**):

source: Select **default** for the desired scheme, clear the request field, and paste the example request code.
ru: Выберите **default** в качестве нужной схемы, очистите поле запроса и вставьте код примера.

source: General object type query
ru: Общий запрос объектов по типу

source: To select objects of a particular type, specify the type's name and the object fields to return. You don't have to indicate all the object fields that are defined in the data model. Specify any number of fields you need. For example:
ru: Чтобы выбрать объекты определенного типа, укажите имя типа, а также нужные вам поля, значения которых требуется получить. Не обязательно указывать все поля объекта, определенные в модели данных. Пример:

source: The response is a JSON object that contains an array with all the records of the ``Country`` type. For each record, the response includes only the fields specified in the request.
ru: Ответ --- объект JSON, содержащий массив со всеми записями типа ``Country``. Для каждой записи ответ включает только указанные в запросе поля.

source: Requests by primary index
ru: Запросы по первичному индексу

source: A specific object can be selected by primary index:
ru: С помощью первичного индекса можно выбрать отдельный объект:

source: Requests by secondary index
ru: Запросы по вторичному индексу

source: Requests by secondary index have the same syntax:
ru: У запросов по вторичному индексу такой же синтаксис:

source: Requests by compound index
ru: Запросы по составному индексу

source: To perform a request by compound index, specify an array of field values:
ru: Чтобы выполнить запрос по составному индексу, укажите массив значений полей:

source: Comparison operators
ru: Операторы сравнения

source: Comparison operators are represented by index name suffixes.
ru: Операторы сравнения представлены суффиксами, которые добавляются к именам индексов.

source: Supported operators:
ru: Поддерживаются следующие операторы:

source: ``_gt`` (Greater Than)
ru: ``_gt`` (больше)

source: ``_ge`` (Greater Than or Equal)
ru: ``_ge`` (больше или равно)

source: ``_lt`` (Less Than)
ru: ``_lt`` (меньше)

source: ``_le`` (Less Than or Equal)
ru: ``_le`` (меньше или равно)

source: For example:
ru: Пример:

source: String field indexes support the ``_like`` operator so you can search for a particular pattern in a string. You can use the wildcard sign ``%`` in the pattern.
ru: При поиске по индексам полей-строк поддерживается оператор ``_like``, который позволяет получать строки, содержащие определенные шаблоны. В шаблонах можно использовать подстановочный символ ``%``.

source: Multiple conditions
ru: Множественные условия

source: You can use several conditions in one request. In this case, the request will search for objects satisfying all the conditions simultaneously (logical AND). Use only indexed fields to specify the conditions.
ru: В одном запросе можно сочетать несколько условий. Тогда TDG будет искать объекты, удовлетворяющие всем условиям одновременно (логическое И). Указывайте в условиях только индексированные поля.

source: Requests by relations
ru: Запросы по отношениям

source: To select objects by relations, use the same syntax as in the general object type query.
ru: Чтобы выбрать объекты по отношениям, используйте тот же синтаксис, что и в общем запросе объектов по типу.

source: In the :ref:`example model <graphql_model_diagram>`, there is a one-to-many relationship between the objects ``Country`` and ``City``. Consequently, you can get the data both about the country and the cities in one request.
ru: В :ref:`примере модели <graphql_model_diagram>` между объектами ``Country`` и ``City`` есть связь «один ко многим». Поэтому вы можете одним запросом получить данные как о стране, так и о городах.

source: Response example:
ru: Пример ответа:

source: Pagination
ru: Разбиение на страницы

source: TDG applies cursor-based pagination similar to the one described in the `GraphQL documentation <http://graphql.org/learn/pagination/#pagination-and-edges>`_.
ru: В TDG применяется разбиение на страницы на основе курсора. Похожий механизм описан в `документации GraphQL <http://graphql.org/learn/pagination/#pagination-and-edges>`_.

source: In general, the request with pagination has the following syntax:
ru: У запроса с разбиением на страницы следующий синтаксис:

source: where
ru: Пояснение:

source: ``first`` specifies the maximum number of elements to return. Defaults to 10.
ru: ``first`` определяет максимальное количество возвращаемых элементов (по умолчанию 10).

source: ``after`` passes an opaque cursor---a string defining the element from which TDG should continue request execution.
ru: ``after`` передает непрозрачный курсор --- строку, определяющую элемент, с которого система TDG должна продолжить выполнение запроса.

source: Here is the first request with pagination:
ru: Вот первый запрос с разбиением на страницы:

source: The response is the following:
ru: Ответ:

source: To get the next data batch, take the ``cursor`` field's value of the last object received and pass it as the ``after`` argument to the next request:
ru: Чтобы получить следующую группу данных, возьмите значение поля ``cursor`` последнего полученного объекта и передайте его в качестве аргумента ``after`` в следующем запросе:

source: Then run this logic in a cycle until you get an empty page:
ru: Повторяйте эту логику, пока не получите пустую страницу:

source: Pagination for requests with relations works in a similar way:
ru: Для запросов с отношениями разбиение на страницы работает аналогичным образом:

source: Reversed pagination is also possible: TDG returns objects preceding the element marked with a cursor. For this, you need to specify a negative value for the ``first`` argument:
ru: Страницы результатов можно выводить и в обратном порядке. В этом случае TDG будет возвращать объекты, предшествующие отмеченному курсором элементу. Чтобы страницы выводились в обратном порядке, укажите для аргумента ``first`` отрицательное значение:

source: Requests by version
ru: Запросы по версии

source: TDG implements object versioning. Consequently, it can run requests by conditions that are based on object versions. For more information, refer to the :doc:`/administration/versioning` page.
ru: В TDG реализовано версионирование объектов, поэтому в условие запроса можно включать версии. Подробности вы найдете на этой странице: :doc:`/administration/versioning`.
