Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/administration/add_node.po
Languages: ru

source: Adding cluster nodes
ru: Добавление узлов в кластер

source: Adding a new node (instance) to a TDG cluster is actually the same deployment operation as you did earlier.
ru: Добавление нового узла (экземпляра) в кластер TDG — это фактически та же операция развертывания.

source: In this example, you will take the already :doc:`deployed TDG cluster </administration/deployment/ansible-deployment>`, deploy a new TDG instance and :ref:`configure <ansible-deploy-topology>` it via web interface by creating a new replica set with the storage :ref:`cluster role <tdg2wn-components>`.
ru: В этом примере мы возьмем уже :doc:`развернутый кластер TDG </administration/deployment/ansible-deployment>`, развернем новый экземпляр TDG и :ref:`настроим его <ansible-deploy-topology>` через веб-интерфейс, создав новый набор реплик с :ref:`кластерной ролью "storage"<tdg2wn-components>`.

source: For deploying a new instance, you will use the same ``tar.gz`` package and the Ansible tool with the :ref:`predefined inventory and playbook configuration <ansible-deploy-conf>` as for the initial cluster deployment.
ru: Чтобы развернуть новый экземпляр, требуются те же ресурсы, что и для первоначального развертывания кластера: пакет ``tar.gz`` и инструмент Ansible с :ref:`предопределенными файлом инвентаря и конфигурацией плейбука <ansible-deploy-conf>`.

source: Navigate to the :ref:`deploy directory <ansible-deploy-conf>` extracted earlier from the ``tar.gz`` package and edit the Ansible inventory file ``hosts.yml``. You need to add the description of a new instance and its parameters. In the code block below, parameters that should be added are marked with the comments ``# <-- Add ...``.
ru: Перейдите в :ref:`директорию развертывания <ansible-deploy-conf>`, извлеченную ранее из пакета ``tar.gz``, и отредактируйте файл инвентаря Ansible ``hosts.yml``. Добавьте описание и параметры нового экземпляра. В приведенном ниже примере кода параметры, которые нужно заполнить, отмечены комментариями ``# <-- Добавьте...``.

source: children: tdg_group: ### Instances ### hosts: ... storage_3: # <-- Add a new instance and its configuration parameters config: advertise_uri: "172.19.0.2:3005" http_port: 8085 memtx_memory: 1073741824 # 1024 Mb children: ### Machines ### vm1: hosts: stateboard_instance: core: runner_1: storage_1: storage_2: storage_3: # <-- Add the instance to the hosts list on vm1 vars: ansible_host: "172.19.0.2"
ru: children: tdg_group: ### Instances ### hosts: ... storage_3: # <-- Добавьте новый экземпляр и параметры конфигурации для него config: advertise_uri: "172.19.0.2:3005" http_port: 8085 memtx_memory: 1073741824 # 1024 Mb children: ### Machines ### vm1: hosts: stateboard_instance: core: runner_1: storage_1: storage_2: storage_3: # <-- Добавьте этот экземпляр к hosts на vm1 vars: ansible_host: "172.19.0.2"

source: While editing ``hosts.yml``, double-check the following parameters:
ru: Внимательно проверьте следующие параметры при редактировании ``hosts.yml``:

source: ``cartridge_package_path``—use the same package of the same application version you used for initial cluster deployment.
ru: ``cartridge_package_path`` — используйте ту же версию пакета, что и при первоначальном развертывании кластера.

source: ``cartridge_cluster_cookie``—should be the same as it was during the initial deployment. Otherwise, the new instance won't be included in the cluster.
ru: ``cartridge_cluster_cookie`` — cookie должен быть тем же, что и во время первоначального развертывания, иначе новый экземпляр не будет включен в кластер.

source: Deploy a new instance by using the ``deploy_without_topology.yml`` playbook:
ru: Выполните развертывание нового экземпляра, используя плейбук ``deploy_without_topology.yml``:

source: The ``--limit`` option is used to apply the playbook steps only to the specified instance and avoid any changes for the existing ones.
ru: Параметр ``--limit`` указывает, что шаги плейбука следует применить только к конкретному экземпляру, не затрагивая другие экземпляры.

source: Open or refresh the page with TDG user interface. In this example, it is located at `http://172.19.0.2:8081 <http://172.19.0.2:8081>`_. The new instance is displayed on the **Cluster** tab in the **Unconfigured servers** section.
ru: Откройте или обновите страницу с интерфейсом TDG. В нашем примере она находится по адресу `http://172.19.0.2:8081 <http://172.19.0.2:8081>`_. Новый экземпляр появится на вкладке **Cluster** в разделе **Unconfigured servers**.

source: The last step is to create a new replica set with the "storage" role. For the "storage_3" instance, click **Configure**. In the **Configure server** dialog, specify the following parameters and click **Create replica set**:
ru: Последний шаг — создание нового набора реплик с ролью "storage". Нажмите **Configure** напротив экземпляра "storage_3". В диалоговом окне **Configure server** укажите следующие параметры и нажмите **Create replica set**:

source: The ``Replica set weight`` parameter should be set to the same value as for other replica sets with the "storage" role. It is necessary to run automatic data rebalancing between the storages upon creating a new storage.
ru: Значение параметра ``Replica set weight`` должно быть таким же, как и в остальных наборах реплик с ролью "storage". Тогда после добавления нового хранилища запустится автоматическая балансировка данных между всеми хранилищами.

source: You can verify if rebalancing was done correctly by checking out the ``Buckets`` parameter: the value should be the same for storage instances on the same server (``172.19.0.2`` in this example). Rebalancing process takes some time, so you may need to wait a bit and refresh the page to see the result in web interface.
ru: Вы можете проверить, корректно ли была проведена балансировка, обратившись к параметру ``Buckets``. Его значение должно совпадать для всех экземпляров с ролью "storage" на одном сервере (``172.19.0.2`` в этом примере). Балансировка займет некоторое время, поэтому результат в веб-интерфейсе появится не сразу: немного подождите и обновите страницу.
