Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/administration/ansible-deployment.po
Languages: ru

source: First deployment with Ansible
ru: Первое развертывание с помощью Ansible

source: This guide explains how to deploy Tarantool Data Grid (TDG) for the first time using Ansible. It offers an option of TDG deployment on two virtual machines with a pre-defined configuration.
ru: В этом руководстве описано, как впервые быстро развернуть Tarantool Data Grid (TDG) с помощью Ansible. Здесь приведен вариант развертывания TDG на двух виртуальных машинах с заданной конфигурацией.

source: Getting a TGZ file for deployment
ru: Подготовка TGZ-файла для развертывания

source: To deploy Tarantool Data Grid, you need an RPM (``.rpm``), TGZ (``tar.gz``), or Docker image (``docker-image.tar.gz``) file. For deployment with Ansible, you can only use either an RPM or a TGZ file. For now, a TGZ file will do just fine. It is easier to deploy and does not require root access.
ru: Чтобы развернуть Tarantool Data Grid, вам понадобится RPM-файл (``.rpm``), TGZ-файл (``tar.gz``) или Docker-образ (``docker-image.tar.gz``). Для развертывания с помощью Ansible подходят только два из них: RPM- и TGZ-файл. В этом руководстве для примера используется TGZ-файл. Его проще развернуть, и вам не потребуется root-доступ.

source: Download a TGZ file of the latest version at the customer zone of `tarantool.io <https://www.tarantool.io/en/accounts/customer_zone/packages/tdg2>`_. Make sure your browser did not unarchive the downloaded file: the file extension should be ``tar.gz``.
ru: Скачайте TGZ-файл последней версии в личном кабинете на сайте `tarantool.io <https://www.tarantool.io/en/accounts/customer_zone/packages/tdg2>`_. Убедитесь, что ваш браузер не разархивировал скачанный файл: расширение файла должно быть ``tar.gz``.

source: If you do not have access to the customer zone, you can get one by applying `this form <https://www.tarantool.io/en/datagrid/#contact>`_ or writing to **sales@tarantool.io**.
ru: Если у вас нет доступа к личному кабинету, заполните `эту форму <https://www.tarantool.io/en/datagrid/#contact>`_ или напишите на **sales@tarantool.io**.

source: Setting up virtual machines
ru: Настройка виртуальных машин

source: For TDG deployment, you need to bring up two virtual machines with Linux OS (CentOS 7/RHEL 7 are preferable) and SSH access. If you already have them, just skip this topic. If you don't have virtual machines, then follow these instructions.
ru: Чтобы развернуть TDG, вам нужно запустить две виртуальные машины с ОС Linux (желательно CentOS 7/RHEL 7) и доступом по SSH. Если у вас уже есть виртуальные машины, то пропустите эту главу. Если нет, то следуйте инструкции.

source: Install `VirtualBox <https://www.virtualbox.org/wiki/Downloads>`_ to run virtual machines and `Vagrant <https://www.vagrantup.com/>`_ to automate the configuration process. Vagrant will prepare the configuration of two virtual machines with additional scripts for TDG to deploy.
ru: Установите `VirtualBox <https://www.virtualbox.org/wiki/Downloads>`_ для запуска виртуальных машин и `Vagrant <https://www.vagrantup.com/>`_ для автоматизации процесса конфигурации. Vagrant подготовит конфигурацию двух виртуальных машин с дополнительными сценариями для развертывания TDG.

source: Make sure you have ``VBoxManage`` in your ``$PATH`` environment variable. Check with the command:
ru: Убедитесь, что в переменной окружения ``$PATH`` у вас есть ``VBoxManage``. Проверьте такой командой:

source: In the downloaded TGZ file, there is a directory called ``deploy``. There you'll find ``Vagrantfile``, which automates the creation of a test environment for cluster deployment.
ru: В скачанном TGZ-файле есть директория под названием ``deploy``. Там находится ``Vagrantfile``, который автоматизирует создание тестовой среды для развертывания кластера.

source: Open the terminal, unpack the ``tar.gz`` archive, go to the ``deploy`` directory, and run virtual machines:
ru: Откройте терминал, распакуйте архив ``tar.gz``, перейдите в директорию ``deploy`` и запустите виртуальные машины:

source: tar xzf tdg-<VERSION>.tar.gz # change <VERSION> for the TDG version you've downloaded cd tdg2/deploy vagrant up
ru: tar xzf tdg-<VERSION>.tar.gz # замените <VERSION> на версию скачанного TDG cd tdg2/deploy vagrant up

source: This command will bring up two virtual machines with CentOS 7 and passwordless SSH access for user ``vagrant``. IP addresses of those machines are: ``172.19.0.2`` and ``172.19.0.3``.
ru: Эта команда поднимет две виртуальные машины с CentOS 7 и доступом по SSH без пароля для пользователя ``vagrant``. IP-адреса этих машин будут такие: ``172.19.0.2`` и ``172.19.0.3``.

source: Deploying the cluster
ru: Развертывание кластера

source: Preparing
ru: Подготовка

source: After you've created virtual machines, install locally `Ansible <https://docs.ansible.com/ansible/latest/installation_guide/>`_ and Tarantool Cartridge `Ansible role <https://github.com/tarantool/ansible-cartridge>`_ (the latest 1.x version). If Ansible role version 2.x is available, you can choose it instead, but you may face some challenges.
ru: После создания виртуальных машин установите локально `Ansible <https://docs.ansible.com/ansible/latest/installation_guide/>`_ и `Ansible-роль <https://github.com/tarantool/ansible-cartridge>`_ для Tarantool Cartridge (последняя версия 1.x). Если доступна Ansible-роль версии 2.x, можно выбрать ее, но тогда вы можете столкнуться с некоторыми трудностями.

source: Here is one of the ways to install Ansible and Ansible role:
ru: Вот один из способов установки Ansible и Ansible-роли:

source: pip install ansible~=4.1.0 # version 4.1 or later, but not version 5.x ansible-galaxy install tarantool.cartridge,1.10.0
ru: pip install ansible~=4.1.0 # версия 4.1 или более поздняя, но не 5.x ansible-galaxy install tarantool.cartridge,1.10.0

source: Configuring
ru: Конфигурация

source: In the ``deploy`` directory, there is the ``hosts.yml`` file. It contains cluster configuration.
ru: В директории ``deploy`` есть файл ``hosts.yml``. В нем лежит конфигурация кластера.

source: Open it to set cluster cookie and path to package:
ru: Откройте этот файл, чтобы указать cookie для кластера и путь до пакета:

source: all vars: # cartridge_package_path: "../../packages/tdg-ENTER-VERSION-HERE.tgz" # path relative to playbook # cartridge_cluster_cookie: "ENTER-SECRET-COOKIE-HERE" # change for "secret-cookie"
ru: all vars: # cartridge_package_path: "../../packages/tdg-ENTER-VERSION-HERE.tgz" # путь до плейбука # cartridge_cluster_cookie: "ENTER-SECRET-COOKIE-HERE" # замените на "secret-cookie"

source: Delete # to uncomment these lines, enter the TDG version that you've downloaded, and specify the path to the TGZ file. Also, set a cluster cookie which should be a unique string. For this tutorial, just "secret-cookie" will do.
ru: Удалите #, чтобы раскомментировать эти строки, укажите версию TDG, которую вы скачали, и путь к TGZ-файлу. Также задайте cookie для кластера. Это должна быть уникальная строка, но для практики достаточно указать "secret-cookie".

source: Here is an example:
ru: Вот пример:

source: If you need to, you can always edit this file to change cluster configuration. Here is some info about file sections:
ru: При необходимости всегда можно отредактировать этот файл, чтобы изменить конфигурацию кластера. Вот информация о секциях файла:

source: ``all.var`` for common variables
ru: ``all.var`` — для общих переменных

source: ``all.children.tdg_group.hosts`` for instances parameters
ru: ``all.children.tdg_group.hosts`` — для параметров экземпляров (инстансов, instances)

source: ``all.children.tdg_group.children`` to specify parameters for a group of instances:
ru: ``all.children.tdg_group.children`` — для параметров группы экземпляров:

source: to group the instances by the host, set their ``ansible_host`` parameter
ru: чтобы сгруппировать экземпляры по хосту, задайте для них параметр ``ansible_host``

source: to group the instances by replica set, set their ``replicaset_alias``, ``roles``, ``failover_priority`` parameters, and so on.
ru: чтобы сгруппировать экземпляры по наборам реплик, задайте для них параметры ``replicaset_alias``, ``roles``, ``failover_priority`` и так далее.

source: You can find more information about parameters in Tarantool Cartridge `Ansible role documentation <https://github.com/tarantool/ansible-cartridge>`_.
ru: Более подробную информацию о параметрах смотрите `в документации по Ansible-роли <https://github.com/tarantool/ansible-cartridge>`_ в Tarantool Cartridge.

source: Deploying
ru: Развертывание

source: In the ``deploy`` directory, there are `Ansible playbooks <https://docs.ansible.com/ansible/latest/user_guide/playbooks_intro.html#about-playbooks>`_ that will help you finish the deployment. There are two options of TDG deployment with the given playbooks:
ru: В директории ``deploy`` находятся `Ansible-плейбуки <https://docs.ansible.com/ansible/latest/user_guide/playbooks_intro.html#about-playbooks>`_, которые помогут вам завершить развертывание. Есть два способа развернуть TDG с помощью плейбуков:

source: Deploying a TDG cluster with completely configured topology.
ru: кластер TDG с полностью сконфигурированной топологией;

source: Deploying a TDG cluster with a list of unconfigured instances.
ru: кластер TDG со списком экземпляров (инстансов, instances) без заданной конфигурации.

source: For a complete TDG deployment with topology, run this command:
ru: Чтобы полностью развернуть TDG с топологией, выполните эту команду:

source: If you want to practice configuring the topology of the cluster via the web interface, run the playbook to deploy only instances:
ru: Если вы хотите cами задать конфигурацию топологии кластера через веб-интерфейс, запустите плейбук, чтобы развернуть только экземпляры:

source: Now you can open `http://172.19.0.2:8081 <http://172.19.0.2:8081>`_ in your web browser to see the cluster web interface. This is what you'll see if you chose to deploy without topology:
ru: Откройте `http://172.19.0.2:8081 <http://172.19.0.2:8081>`_ в браузере, чтобы увидеть веб-интерфейс кластера. Вот как будет выглядеть кластер, развернутый без топологии:

source: Managing the cluster
ru: Управление кластером

source: Configuring topology of the cluster
ru: Конфигурация топологии кластера

source: If you have deployed instances with topology, skip this topic.
ru: Если вы развернули экземпляры (инстансы, instances) с топологией, пропустите эту главу.

source: If you have deployed instances without topology, you can now edit topology by creating replica sets and specifying their parameters in the web interface:
ru: Если вы развернули экземпляры без топологии, теперь вы можете редактировать топологию: создавать наборы реплик и задавать их параметры в веб-интерфейсе:

source: On the Cluster tab, there is a set of unconfigured instances. Select the **core** instance with the ``172.19.0.2:3001`` URL and click **Configure**. You will get the **Configure server** dialog:
ru: На вкладке Cluster находятся экземпляры без заданной конфигурации. Выберите экземпляр **core** с URL ``172.19.0.2:3001`` и нажмите **Configure**. Появится окно **Configure server**:

source: In the **Configure server** dialog, specify two replica set parameters: replica set name and role.
ru: В диалоговом окне **Configure server** укажите значения двух параметров набора реплик: replica set name (имя набора реплик) и role (роль).

source: For the **core** instance, give the replica set name "core" and select the "core" role. After you've set the parameters, click **Create replica set**.
ru: Для экземпляра **core** задайте имя набора реплик "core" и выберите роль "core". После этого нажмите **Create replica set**, чтобы создать набор реплик.

source: Set the same parameters for the rest of the unconfigured instances as follows:
ru: Для остальных экземпляров без заданной конфигурации установите параметры следующим образом:

source: Instance URL
ru: URL экземпляра

source: Replica set name
ru: Имя набора реплик

source: Roles
ru: Роли

source: There are two instances left to configure, **storage_1_replica** with the ``172.19.0.3:3002`` URL and **storage_2_replica** with the ``172.19.0.3:3003`` URL.
ru: Осталось настроить два экземпляра: **storage_1_replica** с URL ``172.19.0.3:3002`` и **storage_2_replica** с URL ``172.19.0.3:3003``.

source: Join them to the already existing replica sets with **storage** roles:
ru: Присоедините их к уже существующим наборам реплик с ролями **storage**:

source: Select **storage_1_replica** and click **Configure**.
ru: Выберите **storage_1_replica** и нажмите **Configure**.

source: In the **Configure server** dialog, switch to the tab called **Join Replica Set**.
ru: В диалоговом окне **Configure server** переключитесь на вкладку **Join Replica Set**.

source: Check **storage_1** and click **Join replica set**.
ru: Отметьте **storage_1** и нажмите **Join replica set**.

source: For **storage_2_replica**, repeat the same steps, but check **storage_2** instead.
ru: Для **storage_2_replica** повторите те же действия, но отметьте **storage_2**.

source: After assigning all roles, enable ``storage`` replica sets by clicking "Bootstrap vshard". It initializes Tarantool ``vshard`` module. You can read more about this module in `Tarantool documentation <https://www.tarantool.io/en/doc/latest/reference/reference_rock/vshard/>`_.
ru: После того, как вы назначите все роли, нажмите "Bootstrap vshard", чтобы включить наборы реплик ``storage``. Это инициализирует модуль Tarantool ``vshard``. Подробнее об этом модуле можно узнать `в документации по Tarantool <https://www.tarantool.io/en/doc/latest/reference/reference_rock/vshard/>`_.

source: You've created virtual buckets that are allocated to storages according to the number of instances with the ``storage`` role.
ru: Вы создали виртуальные сегменты (virtual buckets), которые распределяются по хранилищам — экземплярам с ролью ``storage``.

source: Starting or stopping instances
ru: Запуск или остановка экземпляров

source: This step is optional.
ru: Этот шаг необязателен.

source: In the ``deploy`` directory, there are also playbooks that start or stop the instances. You can stop and disable all instances by ``stop.yml`` playbook:
ru: В директории ``deploy`` также есть плейбуки, которые запускают или останавливают экземпляры. Вы можете остановить и отключить все экземпляры с помощью плейбука ``stop.yml``:

source: You can start and enable all instances by ``start.yml`` playbook:
ru: Запустить и включить все экземпляры можно с помощью плейбука ``start.yml``:
