Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/administration/repair-queue.po
Languages: ru

source: Repair queue
ru: Ремонтная очередь

source: If TDG cannot process an incoming object, the system puts the object in the repair queue. The administrator then checks it, fixes the problem, and sends the object to be processed again.
ru: Если система TDG не может обработать входящий объект, она помещает его в ремонтную очередь. Затем администратор проверяет его, устраняет проблему и отправляет объект на повторную обработку.

source: Input
ru: Вкладка "Input"

source: On the :guilabel:`Repair queues` > :guilabel:`Input` tab, there is a repair queue for submitted objects.
ru: На вкладке :guilabel:`Repair queues` > :guilabel:`Input` находится ремонтная очередь для отправленных объектов.

source: Here you can find the incoming objects that TDG could not process. Here are the main reasons why objects end up in the repair queue:
ru: Сюда попадают входящие объекты, которые система TDG не смогла обработать. Вот основные причины, по которым это происходит:

source: Error when processing an incoming object with a handler.
ru: Ошибка при применении обработчика к входящему объекту.

source: The TDG system expects an object in a particular format, but the incoming object from an external system was submitted in a different format.
ru: Система TDG ожидает объект в определенном формате, а входящий объект из внешней системы был отправлен в другом формате.

source: Internal system error.
ru: Внутренняя системная ошибка.

source: Hardware failure.
ru: Сбой оборудования.

source: You can work with objects in the repair queue through the web interface on the :guilabel:`Input` tab:
ru: С объектами ремонтной очереди можно работать через веб-интерфейс на вкладке :guilabel:`Input`:

source: On this tab, you can see the list of objects, their status ("New", "In Progress", "Reworked"), and the date and time when they were placed in the repair queue.
ru: На этой вкладке можно увидеть список объектов, их статус ("New" — "Новый", "In Progress" — "В процессе", "Reworked" — "Обработан"), а также дату и время, когда они были помещены в ремонтную очередь.

source: The :guilabel:`Repair queue` interface lets you do the following:
ru: Интерфейс :guilabel:`Repair queue` (Ремонтная очередь) позволяет выполнять следующие действия:

source: :guilabel:`Filter`: filter the objects by any combination of characters in any table column or by specifying the date or time range.
ru: :guilabel:`Filter`: фильтрация объектов в любом столбце таблицы по любой комбинации символов, а также по диапазону дат или времени.

source: :guilabel:`Try again`: process the object again by the same handler.
ru: :guilabel:`Try again`: повторно применить к объекту тот же обработчик.

source: :guilabel:`Delete`: delete the selected object from the repair queue.
ru: :guilabel:`Delete`: удалить выбранный объект из ремонтной очереди.

source: :guilabel:`Try again all`: process all objects one more time.
ru: :guilabel:`Try again all`: повторно обработать все объекты.

source: :guilabel:`Delete all`: delete all objects from the repair queue.
ru: :guilabel:`Delete all`: удалить все объекты из ремонтной очереди.

source: Click on the object to see its details:
ru: Выберите объект, чтобы увидеть подробную информацию о нем:

source: In the :guilabel:`Object info` dialog, you can see:
ru: В диалоговом окне :guilabel:`Object info` находится следующая информация:

source: :guilabel:`ID`: the object's UUID.
ru: :guilabel:`ID`: UUID объекта.

source: :guilabel:`Reason`: error description and the complete stack trace.
ru: :guilabel:`Reason`: описание ошибки и полная трассировка стека.

source: :guilabel:`Object`: the object's current structure in the JSON format.
ru: :guilabel:`Object`: текущая структура объекта, представленная в формате JSON.

source: When an object gets into the repair queue, it has the status "New". When it is processed for a second time, the object's status changes to "In Progress". If the object was processed successfully, it is removed from the repair queue. If an error occurs during reprocessing, the system will display an error message. The object will remain in the repair queue with the status "Reworked".
ru: Статус объекта, только что попавшего в ремонтную очередь, --- "New". При повторной обработке статус объекта меняется на "In Progress". Успешно обработанный объект удаляется из очереди. Если во время повторной обработки произойдет ошибка, система сообщит об этом, а объект останется в очереди со статусом "Reworked".

source: Notifications
ru: Уведомления

source: TDG users can receive notifications in case an object gets into the repair queue. To enable notifications, you need a mail server and a list of subscribers---that is, recipients.
ru: Пользователей системы TDG можно оповещать каждый раз, когда в ремонтную очередь попадает новый объект. Чтобы включить уведомления, нужен почтовый сервер и список подписчиков, которые будут их получать.

source: On the :guilabel:`Settings` > :guilabel:`Mail server` tab, set the following parameters:
ru: На вкладке :guilabel:`Settings` > :guilabel:`Mail server` установите следующие параметры:

source: :guilabel:`Url`: the SMTP server used to send notifications.
ru: :guilabel:`Url`: SMTP-сервер, используемый для отправки уведомлений.

source: :guilabel:`From`: the sender that will be shown in the mail client.
ru: :guilabel:`From`: отправитель, отображаемый почтовым клиентом.

source: :guilabel:`Username`: SMTP server user name.
ru: :guilabel:`Username`: имя пользователя SMTP-сервера.

source: :guilabel:`Password`: SMTP server user password.
ru: :guilabel:`Password`: пароль пользователя SMTP-сервера.

source: :guilabel:`Timeout (sec)`: SMTP server request timeout in seconds.
ru: :guilabel:`Timeout (sec)`: время ожидания ответа от SMTP-сервера в секундах.

source: On the :guilabel:`Settings` > :guilabel:`Subscribers` tab, click the :guilabel:`Add subscriber` button to add a new subscriber. Specify the subscriber's name and email. Later, you can edit the subscriber's profile or delete it.
ru: Чтобы добавить нового подписчика, на вкладке :guilabel:`Settings` > :guilabel:`Subscribers` (Подписчики) нажмите кнопку :guilabel:`Add subscriber` (Добавить подписчика). Укажите имя и адрес электронной почты. Позже профиль подписчика можно отредактировать или удалить.

source: Output
ru: Вкладка "Output"

source: The object replication mechanism allows you to send objects to external systems in the desired format. In case of an error during the replication process, the object gets in the replication repair queue on the :guilabel:`Output` tab.
ru: Механизм репликации объектов позволяет посылать объекты внешней системе в нужном формате. Если при репликации возникает ошибка, объект помещается в ремонтную очередь репликации на вкладке :guilabel:`Output`.

source: This queue has the same functions as the :ref:`repair queue <repair-queue-input>` on the :guilabel:`Input` tab. The only difference is that the repair queue on the :guilabel:`Input` tab is for submitted objects that could not be processed and saved, whereas the replication repair queue on the :guilabel:`Output` tab is for objects that could not be replicated.
ru: Эта очередь служит для того же, что и :ref:`ремонтная очередь на вкладке Input <repair-queue-input>`. Единственное отличие: очередь на вкладке :guilabel:`Input` предназначена для отправленных объектов, которые не удалось обработать и сохранить, а ремонтная очередь репликации на вкладке :guilabel:`Output` --- для объектов, которые не удалось реплицировать.

source: To work with objects in the replication repair queue, open the :guilabel:`Repair queues` > :guilabel:`Output` tab:
ru: Для работы с объектами в ремонтной очереди репликации откройте вкладку :guilabel:`Repair queues` > :guilabel:`Output`:

source: Like in the :ref:`repair queue <repair-queue-input>`, you can filter objects, delete them, and try to replicate them again.
ru: Как и в :ref:`ремонтной очереди <repair-queue-input>`, объекты можно фильтровать, удалять и пытаться снова реплицировать.

source: The object status shows the reason why the object ended up in the replication repair queue:
ru: Статус объекта показывает, почему объект оказался в ремонтной очереди репликации.

source: "Preprocessing error": the replicated object was processed with an error.
ru: Preprocessing error: реплицируемый объект был обработан с ошибкой.

source: "Sending error": an error occured while sending the object to an external system.
ru: Sending error: произошла ошибка при отправке объекта во внешнюю систему.

source: If you choose an object and click :guilabel:`Try again`, the object will be processed again. Its status will change from "New" to "In progress". If the operation is successful, the object will be moved to the next stage or deleted from the repair queue. If the operation finishes with an error, the status will change to "Rereplicated (Preprocessing error)" or "Rereplicated (Sending error)". The object will remain in the replication repair queue.
ru: Если вы выберете объект и нажмете :guilabel:`Try again`, он будет обработан снова. Его статус изменится с "New" на "In progress". Если операция пройдет успешно, объект будет перемещен на следующий этап или удален из ремонтной очереди. Если операция завершится с ошибкой, статус объекта изменится на "Rereplicated (Preprocessing error)" или "Rereplicated (Sending error)". При этом объект останется в ремонтной очереди репликации.

source: Jobs
ru: Вкладка "Jobs"

source: This is a repair queue for pending jobs that ended with an error. To monitor these jobs, open the :guilabel:`Repair queues` > :guilabel:`Jobs` tab:
ru: Чтобы увидеть ремонтную очередь для отложенных задач, завершенных с ошибкой, откройте вкладку :guilabel:`Repair queues` > :guilabel:`Jobs`:

source: This tab has the same functions as the :ref:`repair queue for submitted objects <repair-queue-input>` on the :guilabel:`Input` tab.
ru: Эта очередь служит для того же, что и :ref:`ремонтная очередь для отправленных объектов <repair-queue-input>` на вкладке :guilabel:`Input`.
