Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/administration/webui.po
Languages: ru

source: Web UI
ru: Веб-интерфейс

source: This chapter explains how to access TDG web UI and sign in. It also gives an overview of the web UI controls and functions.
ru: В этой главе рассказано, как получить доступ к веб-интерфейсу TDG и авторизоваться в системе. Кроме того, в главе описаны элементы управления и функции, представленные в веб-интерфейсе.

source: In the example below, authorization to the TDG system is already enabled. To learn how to enable authorization, read the :doc:`authorization guide <security/authorization>`.
ru: В примере ниже описана ситуация, когда авторизация в системе TDG уже включена. Подробнее о том, как включить авторизацию, вы можете узнать из :doc:`руководства по авторизации <security/authorization>`.

source: Signing in
ru: Вход в систему

source: To access the TDG web interface, you need to sign in:
ru: Чтобы получить доступ к веб-интерфейсу TDG, выполните следующие шаги:

source: Contact your administrator to get your credentials:
ru: Обратитесь к администратору за данными учетной записи.

source: **Username**: login that is automatically generated when the administrator creates a :doc:`user profile <security/users>`. For example, ``ui8896`` or ``gz1200``.
ru: **Username**: имя пользователя генерируется автоматически, когда администратор создает :doc:`профиль пользователя <security/users>`. Примеры имени пользователя: ``ui8896``, ``gz1200``.

source: **Password**: automatically generated when the administrator creates a :doc:`user profile <security/users>`.
ru: **Password**: пароль генерируется автоматически, когда администратор создает :doc:`профиль пользователя <security/users>`.

source: **TDG server address**: ``http://<address>:<http_port>``, is set by the administrator in the configuration file. This guide uses the ``http://172.19.0.2:8080`` server address as an example.
ru: **Адрес сервера TDG**: администратор задает адрес сервера в формате ``http://<адрес>:<порт_http>`` в файле конфигурации. В этом руководстве в качестве примера используется адрес сервера ``http://172.19.0.2:8080``.

source: Open the TDG server address in the browser. You will see the authorization dialog:
ru: В браузере введите адрес сервера TDG, чтобы открыть диалоговое окно авторизации.

source: Input your credentials. In the **Username** text field, enter your login. In the **Password** text field, enter your password.
ru: Введите учетные данные: в поле **Username** — имя пользователя, а в поле **Password** — пароль.

source: Click **Login**.
ru: Нажмите **Login**.

source: During the authorization process, the TDG system will check that your credentials are correct. Also, it will check your access rights to particular TDG tabs. After a successful authorization, you will see the TDG interface. You will only get access to certain tabs in the TDG interface. It depends on the :doc:`user role <security/role-access>` that the administrator has given you.
ru: Во время авторизации система TDG проверяет правильность ваших учетных данных и права доступа к определенным вкладкам TDG. После успешной авторизации вы увидите интерфейс TDG с доступом только к определенным вкладкам. Набор вкладок зависит от :doc:`роли пользователя <security/role-access>`, которую вам назначил администратор.

source: If there is a typo in the credentials, TDG won't be able to identify you. In that case, you will see the "Authentication failed" message:
ru: Если вы допустите опечатку в учетных данных, TDG не сможет вас идентифицировать. В этом случае появится сообщение "Authentication failed":

source: Try to input your credentials one more time.
ru: Попробуйте ввести учетные данные еще раз.

source: Web UI overview
ru: Общее описание веб-интерфейса

source: In the TDG interface, there are two sections:
ru: Интерфейс TDG состоит из двух частей:

source: **Tab pane**: a list of tabs to switch between different sections of TDG.
ru: **Панель вкладок** отображает список вкладок для навигации по разделам TDG.

source: **Working area**: displays the contents of the selected tab.
ru: **Рабочая область** отображает содержание активной вкладки.

source: Tab pane
ru: Панель со вкладками

source: The contents of the tab pane vary depending on the :doc:`user role <security/role-access>`. Users with the "admin" and "supervisor" rights can see all tabs. Users with the access rights of the "user" role have access to a limited set of tabs.
ru: Доступ к той или иной вкладке зависит от :doc:`роли пользователя <security/role-access>`. Например, пользователи с ролями "admin" и "supervisor" видят все вкладки, а пользователю с ролью "user" доступен ограниченный набор.

source: At the bottom of the page, there is a **Collapse menu** button. Click it to hide the full tab pane view.
ru: Кнопка **Collapse menu** в нижней части страницы служит для переключения панели вкладок в компактный режим и обратно.

source: The tab pane consists of the following tabs:
ru: На панели расположены следующие вкладки:

source: Cluster configuration and administration.
ru: Конфигурация и администрирование кластера.

source: TDG configuration settings management.
ru: Управление параметрами конфигурации TDG.

source: Sending test queries in JSON or XML (SOAP) format.
ru: Отправка тестовых запросов в формате JSON или XML (SOAP).

source: Sending queries in GraphQL format.
ru: Отправка запросов в формате GraphQL.

source: Current data model uploaded to the system.
ru: Актуальная модель данных, загруженная в систему.

source: Repair queue for the uploaded objects.
ru: Ремонтная очередь для загруженных объектов.

source: Repair queue for the objects replicated to external systems.
ru: Ремонтная очередь для объектов, реплицированных во внешние системы.

source: Repair queue for pending jobs that ended with an error.
ru: Ремонтная очередь для завершенных с ошибкой задач.

source: Event log.
ru: Журнал событий.

source: Audit log.
ru: Журнал аудита.

source: Task management.
ru: Управление задачами.

source: Data types that are represented in the uploaded data model.
ru: Типы данных, представленные в загруженной модели данных.

source: Connector creation and management.
ru: Создание коннекторов и управление ими.

source: System settings management.
ru: Управление настройками системы.

source: English version of TDG documentation that is available locally. It is deployed from the package with the rest of TDG. As a result, it only contains the chapters published before the package was formed. You can read the up-to-date documentation both in English and in Russian at `tarantool.io <https://www.tarantool.io/en/tdg/latest/>`_.
ru: Версия документации TDG на английском языке, доступная локально из разворачиваемого пакета TDG. Таким образом, она содержит только ту информацию, которая была опубликована до формирования пакета. Актуальную документацию на русском и английском языках вы можете найти на сайте `tarantool.io <https://www.tarantool.io/en/tdg/latest/>`_.

source: Cluster tab
ru: Вкладка Cluster

source: The **Cluster** tab displays the current status of the TDG instances cluster. You can administrate it via UI. There are several groups of elements in the interface for cluster management:
ru: На вкладке **Cluster** отображается текущий статус кластера экземпляров TDG. На этой вкладке вы можете администрировать кластер через веб-интерфейс. Элементы управления можно разделить на несколько групп:

source: Replica sets
ru: Раздел Replica sets

source: In the highlighted area, you can see general replica set statistics:
ru: В выделенной области отображается основная статистика по наборам реплик (replica sets).

source: Total number of replica sets in the cluster.
ru: Общее количество наборов реплик в кластере.

source: Number of replica sets with the "unhealthy" status.
ru: Количество наборов реплик в статусе "unhealthy".

source: Total number of TDG instances.
ru: Общее количество экземпляров TDG.

source: A dropdown menu to filter replica sets by status or cluster role.
ru: Выпадающее меню, позволяющее фильтровать наборы реплик по статусу или кластерной роли.

source: Search box
ru: Окно поиска

source: A search box to display replica sets filtered by URI, UUID, role, alias, or labels.
ru: Поле для поиска наборов реплик с возможностью фильтрации по URI, UUID, роли, алиасу или меткам.

source: Replica set widget
ru: Виджет набора реплик

source: The following statistics are available in the replica set widget:
ru: В виджете набора реплик отображается следующая информация:

source: Name and role
ru: Имя и роль

source: For example, replica set "storage_1" with the role "storage".
ru: Например, набор реплик "storage_1" с ролью "storage".

source: Status
ru: Статус

source: "Healthy" means the current replica set functions properly. "Unhealthy" means the current replica set is not available or does not function properly.
ru: Статус "healthy" означает, что набор реплик функционирует нормально. Статус "unhealthy" означает, что набор реплик недоступен или функционирует неправильно.

source: Storage group and replica set weight
ru: Вес набора реплик и группа, к которой набор относится

source: Only for replica sets with the "storage" role. For example, storage group "default", replica set weight "1".
ru: Только для наборов реплик с ролью "storage". Например: группа (storage group) --- "default", вес (replica set weight) --- 1.

source: **Edit** button
ru: Кнопка **Edit**

source: Opens a dialog where you can edit the parameters of the replica set.
ru: Открывает диалоговое окно, в котором можно редактировать параметры набора реплик.

source: Instances widgets
ru: Виджеты экземпляров

source: The widgets of the instances included in this replica set.
ru: Виджеты экземпляров, включенных в этот набор реплик.

source: Instance widget
ru: Виджет экземпляра

source: The widget of the instance is in the highlighted area. It allows you to see the following information about the instance:
ru: Виджет экземпляра в выделенной области содержит следующую информацию:

source: Instance name
ru: Имя экземпляра

source: For example, "storage_1" or "storage_1_replica".
ru: Например, "storage_1" или "storage_1_replica".

source: Instance URI for binary port access. Is set in the cluster configuration via the ``advertise_uri`` parameter. For example, ``172.19.0.2:3003``.
ru: URI для доступа по бинарному порту. Задается параметром ``advertise_uri`` в конфигурации кластера (например, ``172.19.0.2:3003``).

source: "Healthy" means the current instance functions properly. "Unhealthy" means the current instance is not available or does not function properly.
ru: Статус "healthy" означает, что экземпляр функционирует нормально. Статус "unhealthy" означает, что экземпляр недоступен или функционирует неправильно.

source: Leader indicator
ru: Индикатор лидера

source: Indicates if the instance is the leader in the replica set.
ru: Показывает, является ли инстанс лидером (leader) в наборе реплик.

source: Memory usage indicator
ru: Индикатор памяти

source: The actual memory used / memory limit set for the instance. For example, 3.3 MiB / 1024.0 MiB.
ru: Фактически используемая память / лимит памяти, заданный для этого экземпляра. Например, 3.3 MiB / 1024.0 MiB.

source: Virtual buckets indicator
ru: Индикатор виртуальных сегментов

source: Indicates the number of virtual buckets on the instance. Only for replica sets with the "storage" role.
ru: Показывает количество виртуальных сегментов экземпляра (только для наборов реплик с ролью "storage").

source: ``…`` button
ru: Кнопка ``…``

source: Options to see instance details, promote the instance as a leader, disable or expel the instance.
ru: Меню с набором функций: просмотр информации об экземпляре, назначение экземпляра лидера, отключение или исключение экземпляра.

source: Instance details
ru: Информация об экземпляре

source: For each instance, you can view detailed information about its parameters in read-only mode. On the **Cluster** tab of the instance, click ``…`` > **Server details**:
ru: Подробную информацию о параметрах каждого экземпляра можно просмотреть в режиме только для чтения. Для этого на вкладке **Cluster** рядом с нужным экземпляром нажмите ``…`` > **Server details**:

source: You will see a pop-up window with detailed information about the instance parameters:
ru: Появится окно с подробной информацией о параметрах экземпляра:

source: More functions
ru: Другие функции

source: Several more TDG functions are also available on the **Cluster** tab:
ru: На вкладке **Cluster** доступны еще несколько функций:

source: The history of issues occurring in the cluster operation.
ru: Просмотр истории ошибок, возникших при работе кластера

source: Manual server availability check. Used when configuring a cluster.
ru: Ручная проверка доступности сервера (используется при настройке кластера)

source: Enable and disable mandatory authorization mode.
ru: Включение и отключение режима обязательной авторизации

source: Switch for automatic recovery mode after failure.
ru: Переключение режима автоматического восстановления после отказа
