Repository: Voloodya/tarantool_arh
Catalog: .rocks/share/tarantool/rocks/tdg/scm-1/doc/source/locale/*/LC_MESSAGES/administration/deployment/run-*-docker.po
Languages: in

source: Running Tarantool Data Grid in Docker
in: Запуск Tarantool Data Grid в Docker

source: You can run Tarantool Data Grid (TDG) as a Docker container to develop your solution or check if TDG is suitable for your project.
in: Вы можете запустить TDG в Docker-контейнере, чтобы разработать свое решение или проверить, подходит ли Tarantool Data Grid для вашего проекта.

source: This guide will show you how to:
in: В этом руководстве рассказано, как:

source: :ref:`Download the Docker image file <download-docker-image>`.
in: :ref:`скачать файл с Docker-образом <download-docker-image>`;

source: :ref:`Run a TDG instance as a Docker container <run-container>`.
in: :ref:`запустить экземпляр (инстанс, instance) TDG в Docker-контейнере <run-container>`;

source: :ref:`Configure the instance <configure-instance>`.
in: :ref:`настроить экземпляр <configure-instance>`.

source: Getting Docker image file for deployment
in: Подготовка файла с Docker-образом для развертывания

source: Download the Docker image file of the latest version at the customer zone of `tarantool.io <https://www.tarantool.io/en/accounts/customer_zone/packages/tdg2>`_. The download link looks like ``tdg-<version>-<hash>-docker-image.tar.gz``.
in: В личном кабинете `tarantool.io <https://www.tarantool.io/en/accounts/customer_zone/packages/tdg2>`_ скачайте файл с Docker-образом последней версии. Ссылка на скачивание выглядит так: ``tdg-<версия>-<хеш>-docker-image.tar.gz``.

source: If you do not have access to the customer zone, you can get one by applying `this form <https://www.tarantool.io/en/datagrid/#contact>`_ or writing to **sales@tarantool.io**.
in: Если у вас нет доступа к личному кабинету, заполните `эту форму <https://www.tarantool.io/en/datagrid/#contact>`_ или напишите на **sales@tarantool.io**.

source: Running an instance
in: Запуск экземпляра

source: First, load the Docker image from the file that you've downloaded:
in: Сначала загрузите Docker-образ из скачанного файла:

source: $ # change <version> and <hash> for the TDG version that you've downloaded $ docker load --input tdg2_tdg-<version>-<hash>docker-image.tar.gz
in: $ # замените <version> и <hash> на версию и хеш скачанного TDG $ docker load --input tdg2_tdg-<version>-<hash>docker-image.tar.gz

source: The output will look like the following:
in: Результат будет выглядеть так:

source: For details about ``docker load``, refer to the `Docker documentation <https://docs.docker.com/engine/reference/commandline/load/>`__.
in: Подробнее о ``docker load`` можно прочитать в `документации Docker <https://docs.docker.com/engine/reference/commandline/load/>`__.

source: Find an archive named ``tdg`` in the list of images:
in: В списке образов найдите архив под названием ``tdg``:

source: Now run a container with a TDG instance:
in: Теперь запустите контейнер с экземпляром TDG:

source: For example:
in: Пример:

source: You will now find the unconfigured instance at `localhost:8080 <http://localhost:8080>`_:
in: Экземпляр без заданной конфигурации теперь можно найти по адресу `localhost:8080 <http://localhost:8080>`_:

source: Configuring instance
in: Конфигурация экземпляра

source: On the Cluster tab, there is an unconfigured instance. To access all basic functions to work with data, click **Configure**. You will get the **Configure server** dialog:
in: На вкладке **Cluster** находится экземпляр без заданной конфигурации. Чтобы получить доступ ко всем базовым функциям работы с данными, нажмите **Configure**. Появится окно **Configure server**:

source: In the **Configure server** dialog, specify two replica set parameters: replica set name and roles. Set any name and choose **Select all** option to switch on these roles:
in: В диалоговом окне **Configure server** укажите значения двух параметров набора реплик: replica set name (имя набора реплик) и roles (роли). Задайте любое имя и выберите **Select all**, чтобы включить эти роли:

source: ``core``: configuration and administration
in: ``core``: настройка и администрирование;

source: ``runner``: running the business logic using Lua code
in: ``runner``: запуск бизнес-логики с помощью кода на Lua;

source: ``connector``: data exchange with external systems
in: ``connector``: обмен данными с внешними системами;

source: ``storage``: data validation and storage
in: ``storage``: проверка и хранение данных.

source: ``failover-coordinator`` role enables by default. You can read more about this role in `Tarantool Cartridge documentation <https://github.com/tarantool/cartridge/blob/master/rst/topics/failover.rst#stateful-failover>`_.
in: Роль ``failover-coordinator`` включена по умолчанию. Подробнее об этой роли можно узнать в `документации по Tarantool Cartridge <https://github.com/tarantool/cartridge/blob/master/rst/topics/failover.rst#stateful-failover>`_.

source: After assigning all roles, click **Create replica set**.
in: После назначения всех ролей нажмите **Create replica set**, чтобы создать набор реплик.

source: In this example, all roles are switched simultaneously in one replica set. It is a good way to practice and see what TDG can do, but a wrong pattern to follow in production.
in: В этом примере все роли включаются одновременно в одном наборе реплик. Это удобно для практики и позволяет больше узнать о возможностях TDG, но в производственной среде так делать не стоит.

source: Initialize Tarantool ``vshard`` module by clicking **Bootstrap vshard**:
in: Нажмите **Bootstrap vshard**, чтобы инициализировать Tarantool-модуль ``vshard``:

source: You can read more about this module in `Tarantool documentation <https://www.tarantool.io/en/doc/latest/reference/reference_rock/vshard/>`_.
in: Для получения дополнительной информации об этом модуле обратитесь к `документации по Tarantool <https://www.tarantool.io/en/doc/latest/reference/reference_rock/vshard/>`_.
